In [ ]:
import duckdb

In [ ]:
con = duckdb.connect(database='dados_duckdb.db', read_only=False)

In [ ]:
df = con.execute("SELECT * FROM produtos").fetchdf()
df.head(50)

In [ ]:
df2 = df.drop(columns=['id_categoria','id_fornecedor'])
df2.head(50)

In [ ]:
con.execute("""
    CREATE TABLE IF NOT EXISTS dim_produtos (
            id_produto BIGINT,
            nm_produto TEXT,
            vl_produto FLOAT
               )


""")

In [ ]:
con.execute("""
DROP TABLE IF EXISTS dim_produtos;

""")

In [ ]:
df2.head(50)

In [ ]:
con.execute("INSERT INTO dim_produtos SELECT * FROM df2")

In [ ]:
df_dim = con.execute("SELECT * FROM dim_produtos").fetchdf()
df_dim.head(50)

In [ ]:
df2.head(50)

In [ ]:
con.execute("INSERT INTO dim_produtos SELECT * FROM df2")

In [53]:
df_dim.head(50)

   id_produto nm_produto  vl_produto
0       10004      SERRA       120.0
1       10005    MACHADO       200.0
2       10002      PORCA       150.0
3       10001   PARAFUSO       100.0
4       10003    ARRUELA       250.0

In [ ]:
con.close()